#+PROPERTY: header-args :dir ..
#+PROPERTY: header-args:python :session error-sampling

#+begin_src python
  from velimir.accentuator import is_vowel, stress_mark_ord, remove_accent_marks

  def put_accents(line: str, mask: list[bool]):
      res = ""
      vowel_pos = 0

      for c in remove_accent_marks(line):
          res += c
          if is_vowel(c):
              if mask[vowel_pos]:
                  res += chr(stress_mark_ord)
              vowel_pos += 1

      return res
#+end_src

#+RESULTS:
: None

#+begin_src python
  import sqlite3
  import hashlib

  conn = sqlite3.connect(PREDICTION_DB_PATH)
  conn.create_function("md5", 1, lambda s: hashlib.md5(s.encode("utf8")).hexdigest())
#+end_src

#+RESULTS:
: None

#+begin_src python :results value
  from bitarray import bitarray
  from bs4 import BeautifulSoup

  from velimir.parsers import extract_lines, extract_syllable_masks
  from velimir.io import read_poem_xml
  from velimir.evaluation import meters_to_str
  from velimir.ml_loader import MeterClassRegistry
  from velimir.settings import PREDICTION_DB_PATH

  TOTAL_SAMPLES = 100

  MeterClassRegistry.initialize()

  strata = conn.execute("""
      SELECT mc_target, mc_pred, freq FROM error_strata WHERE freq > 0.01
  """).fetchall()

  allocations = []
  for mc_target, mc_pred, freq in strata:
      n = round(freq * TOTAL_SAMPLES)
      if n > 0:
          allocations.append((mc_target, mc_pred, n))

  samples = [("Текст", "Разметка ударений", "Поэтические ударения", "Метр (корпус)", "Предсказанный метр", "Цезура (корпус)", "Предсказанная цезура", "Файл")]

  for mc_target, mc_pred, n_samples in allocations:
      res = conn.execute("""
          SELECT poem_path, line_idx, meter_class_target, meter_class_pred, accent_pred
          FROM predictions
          WHERE meter_class_target = ?
              AND meter_class_pred = ?
          ORDER BY md5(poem_path || line_idx || '4242')
          LIMIT ?
      """, (mc_target, mc_pred, n_samples))

      while row := res.fetchone():
          poem_path, line_id, target_class, pred_class, accent_pred = row

          target_class, pred_class = map(MeterClassRegistry.int_to_mc, (target_class, pred_class))

          poem_xml = read_poem_xml(poem_path)
          soup = BeautifulSoup(poem_xml, "xml")
          lines = list(extract_lines(soup))

          line = lines[line_id]

          caesura_to_str = lambda c: "-".join(map(str, c.caesura)) or '-'

          ling_accents = put_accents(line.text, extract_syllable_masks(line.text).linguistic_accent_mask)
          poetic_accents = put_accents(line.text, bitarray(accent_pred))

          samples.append((line.text, ling_accents, poetic_accents, meters_to_str(target_class), meters_to_str(pred_class), caesura_to_str(target_class), caesura_to_str(pred_class), poem_path))

  samples
#+end_src

#+RESULTS:
| Текст                                                        | Разметка ударений                                            | Поэтические ударения                                         | Метр (корпус) | Предсказанный метр | Цезура (корпус) | Предсказанная цезура | Файл                          |
| За̀верша̀ется̀ / восста̀нием / гнѐва на̀раста̀ние,                 | Заверша̀ется / восста̀нием / гнѐва нараста̀ние,                 | Заверша̀ется / восста̀нием / гнѐва нараста̀ние,                 | Дк            | Тк                 | -               | -                    | xx/majakovsky/majak8-162      |
| А̀ по стенѐ... а̀ по стенѐ... а̀ по стенѐ                       | А по стенѐ... а по стенѐ... а по стенѐ                       | А по̀ стенѐ... а по стенѐ... а по стенѐ                       | Дк            | Тк                 | -               | -                    | xx/avantgarde/avan-1032       |
| Про̀сто та̀к сложѝлось губа̀м,                                  | Про̀сто так сложѝлось губам,                                  | Про̀сто так сложѝлось губа̀м,                                  | Дк            | Тк                 | -               | -                    | xx/kirsanov/kirsan-290        |
| Столько ра̀з руко̀й помертвѐлой                                | Сто̀лько раз руко̀й по̀мертвелой                                | Сто̀лько раз руко̀й помертвѐлой                                | Дк            | Тк                 | -               | -                    | xx/axmatova/axmat-188         |
| Та̀к -- / лишь ма̀льчик сперва̀, / а не по̀зднею                 | Так -- / лишь ма̀льчик сперва̀, / а не позднѐю                 | Так -- / лишь ма̀льчик сперва̀, / а не по̀зднею                 | Дк            | Ан                 | -               | -                    | xx/andreev/andrv-092          |
| И, отклѐив реснѝцы-спѝцы                                     | И, отклеив реснѝцы-спицы                                     | И, отклѐив реснѝцы-спицы                                     | Дк            | Ан                 | -               | -                    | xx/mariavega/mvega-207        |
| Га̀зы, та̀нки, винто̀вки,                                       | Га̀зы, та̀нки, винто̀вки,                                       | Газы, та̀нки, винто̀вки,                                       | Дк            | Ан                 | -               | -                    | xx/1920/1920-024              |
| Подо мно̀й висѐло, --                                         | Подо̀ мной висело, --                                         | Подо мно̀й висело̀, --                                         | Дк            | Ан                 | -               | -                    | xx/1950-1960s/midms-232       |
| А пѐснями на̀шими многоу̀стыми.                                | А песнями на̀шими многоу̀стыми.                                | А пѐснями на̀шими многоу̀стыми.                                | Дк            | Ак                 | -               | -                    | xx/1920/1920-1143             |
| Обува̀ют властѝтельных, одева̀ют онѝ именѝтых.                 | Обувают властѝтельных, одева̀ют онѝ именѝтых.                 | Обува̀ют властѝтельных, одева̀ют онѝ именѝтых.                 | Дк            | Ак                 | -               | -                    | xx/1920/1920-431              |
| Не нужда̀ясь в безврѐменья проволо̀чке,                        | Не нужда̀ясь в безврѐменья проволочке,                        | Не нужда̀ясь в безврѐменья проволо̀чке,                        | Дк            | Ак                 | -               | -                    | xx/okhapkin/okhapkin-006      |
| Только на̀ш лука̀вый, прелюбодѐйный ро̀д                        | То̀лько наш лука̀вый, прелюбодѐйный род                        | Только на̀ш лука̀вый, прелюбодѐйный ро̀д                        | Дк            | Ак                 | -               | -                    | xx/kenzheev/baxyt-209         |
| Мне хо̀рошо̀ боя̀ться                                           | Мне хорошо̀ боя̀ться                                           | Мнѐ хорошо̀ боя̀ться                                           | Я             | Дк                 | -               | -                    | xx/axmadulina/axmad-152       |
| Иста̀ют бы̀стрыѐ / Года̀,                                       | Истают бы̀стрые / Го̀да,                                       | Иста̀ют бы̀стрые / Го̀да,                                       | Я             | Дк                 | -               | -                    | xx/bely/bely-473              |
| Винто̀вка в со̀шки у̀перла̀сь...                                 | Винто̀вка в со̀шки уперла̀сь...                                 | Винто̀вка в со̀шки упѐрлась...                                 | Я             | Дк                 | -               | -                    | xix/1860/1860-185             |
| Вот о̀н! Одѐтый со̀лнцем,                                      | Вот он! Одѐтый со̀лнцем,                                      | Во̀т он! Одѐтый со̀лнцем,                                      | Я             | Дк                 | -               | -                    | xx/avantgarde/avan-0656       |
| Просто̀наро̀дной у̀далью̀ и стра̀стью.                            | Простонаро̀дной удалью̀ и стра̀стью.                            | Простонаро̀дной у̀далью и стра̀стью.                            | Я             | Тк                 | -               | -                    | xx/kibirov/kibir-102          |
| поло̀жить по̀бедѝвшую̀ кома̀нду.                                 | положѝть победѝвшую кома̀нду.                                 | положѝть победѝвшую кома̀нду.                                 | Я             | Тк                 | -               | -                    | xx/baitov/bait-344            |
| пряжѐниѐ в лицѐ                                              | пряжѐние в лицѐ                                              | пряжѐние в лицѐ                                              | Я             | Тк                 | -               | -                    | xx/sapgir/sapgr-280           |
| Изва̀янны̀й на твѐрди о̀гнево̀й!                                 | Извая̀нный на твѐрди огнево̀й!                                 | Извая̀нный на твѐрди огнево̀й!                                 | Я             | Тк                 | -               | -                    | xx/vivanov/vivan-0422         |
| Я зна̀ю.                                                      | Я зна̀ю.                                                      | Я зна̀ю.                                                      | Я             | Аф                 | -               | -                    | xx/briusov/brius-0297         |
| (Поскрѝпыванье,                                              | (Поскрѝпыванье,                                              | (Поскрѝпыванье,                                              | Я             | Аф                 | -               | -                    | xx/cvetaeva/cvet4-045         |
| Споѐмте!                                                     | Споѐмте!                                                     | Споѐмте!                                                     | Я             | Аф                 | -               | -                    | xx/satunovskiy/satun-620      |
| Твой встрѐтит?                                               | Твой встрѐтит?                                               | Твой встрѐтит?                                               | Я             | Аф                 | -               | -                    | xix/zhukovsky/zhuk-604        |
| Что̀бы жѝзнь Тебѐ протѝвоста̀ла,                               | Что̀бы жизнь Тебѐ противоста̀ла,                               | Чтобы жѝзнь Тебѐ противоста̀ла,                               | Х             | Тк                 | -               | -                    | xx/schwarz/schwar-230         |
| Ско̀ро бу̀дешь ты̀ в ней, бу̀дто гро̀м.                           | Ско̀ро бу̀дешь ты в ней, бу̀дто гром.                           | Скоро бу̀дешь ты в ней, бу̀дто гро̀м.                           | Х             | Тк                 | -               | -                    | xx/schwarz/schwar-384         |
| Что̀б он, мѐртвый, пра̀вил ѝ кара̀л:                            | Чтоб он, мѐртвый, пра̀вил и кара̀л:                            | Чтоб он, мѐртвый, пра̀вил и кара̀л:                            | Х             | Тк                 | -               | -                    | xx/ehrehnburg/eren-395        |
| Ка̀к приро̀да, я̀ зелѐная                                       | Как приро̀да, я зеленая                                       | Как приро̀да, я зелѐная                                       | Х             | Тк                 | -               | -                    | xx/nikolev/nikol-58           |
| Г-ы̀-ы-у! Г-о̀-о-у-у! Г-ѐ-ей!                                  | Г-ы̀-ы̀-у̀! Г-о̀-о̀-у̀-у̀! Г-ѐ-ѐй!                                  | Г-ы-ы-у̀! Г-о̀-о-у-у! Г-ѐ-ѐй!                                  | Х             | Дк                 | -               | -                    | xx/1920/1920-644              |
| мѝриа̀ды ка̀пель в го̀ловѐ его̀ --                               | мириа̀ды капѐль в головѐ его̀ --                               | мириа̀ды капѐль в головѐ его̀ --                               | Х             | Дк                 | -               | -                    | xx/sapgir/sapgr-786           |
| лю̀ди мы̀ -- не э̀лектро̀ужѝ,                                    | лю̀ди мы -- не электроу̀жи,                                    | люди мы̀ -- не электроу̀жи,                                    | Х             | Дк                 | -               | -                    | xx/voznesensky/vozns-176      |
| бунто̀вщиком и / фальшѝвомонѐтчиком.                          | бунтовщико̀м и / фальшивомонѐтчиком.                          | бу̀нтовщико̀м и / фальшѝвомонѐтчиком.                          | Дк            | Д                  | -               | -                    | xx/okudzhava/okudz-003        |
| но я̀ / с крова̀тного бѐрега                                   | но я / с крова̀тного бѐрега                                   | но̀ я / с крова̀тного бѐрега                                   | Дк            | Д                  | -               | -                    | xx/kirsanov/kirsan-076        |
| Пощекочѝте еще                                               | Пощеко̀чите ѐще                                               | По̀щекочѝте ещѐ                                               | Дк            | Д                  | -               | -                    | xx/krutchenych/kruch-101      |
| Как пѐс я служу̀ его взгля̀ду.                                 | Как пес я служу̀ его̀ взгля̀ду.                                 | Как пес я̀ служу̀ его взгля̀ду.                                 | Аф            | Дк                 | -               | -                    | xx/xvostenko/xvost-212        |
| И, ста̀н худоща̀вый к лукѐ наклоня̀,                            | И, стан худоща̀вый к луке накло̀ня,                            | И, ста̀н худоща̀вый к лу̀ке накло̀ня,                            | Аф            | Дк                 | -               | -                    | xix/lermontov/le2-124-        |
| И смѐртью зева̀ет над мі̀ром -- сонлѝвой,                      | И смѐртью зева̀ет над міром -- сонливой,                      | И смѐртью зева̀ет над міро̀м -- сонлѝвой,                      | Аф            | Дк                 | -               | -                    | xx/pereleshin/perel-136       |
| Речь высо̀кая,                                                | Речь высо̀кая,                                                | Рѐчь высо̀кая,                                                | Ан            | Х                  | -               | -                    | xix/kolcov/kolc-100           |
| сновидѐние.                                                  | сновидѐние.                                                  | сно̀видѐние.                                                  | Ан            | Х                  | -               | -                    | xx/rubtsov/rubts-123          |
| Шире дѐдова,                                                 | Шѝре дедова,                                                 | Шѝре дѐдова,                                                 | Ан            | Х                  | -               | -                    | xix/kolcov/kolc-084           |
| Пу̀шкин бро̀сил гро̀мову̀ю фра̀зу:                                | Пу̀шкин бро̀сил громо̀вую фра̀зу:                                | Пушкин бро̀сил громо̀вую фра̀зу:                                | Х             | Ан                 | -               | -                    | xx/tarlovsky/tarl-184         |
| Сто̀л накры̀т,                                                 | Стол накры̀т,                                                 | Стол накры̀т,                                                 | Х             | Ан                 | -               | -                    | xx/kuzmin/kzmn-521            |
| Закипа̀ние -- до̀ -- кѝпени                                    | Закипа̀ние -- до -- кипѐни                                    | За̀кипа̀ниѐ -- до -- кѝпени                                    | Дк            | Х                  | -               | -                    | xx/cvetaeva/cvet2-188         |
| А мы̀ с тобо̀й отползлѝ                                        | А мы с тобо̀й отползлѝ                                        | А̀ мы с то̀бой о̀тползлѝ                                        | Дк            | Х                  | -               | -                    | xx/bashlachev/bashl-35        |
| Пробы̀л он с нѐю до̀ утра̀...                                   | Про̀был он с нѐю до утра̀...                                   | Пробы̀л он с нѐю до̀ утра̀...                                   | Я             | Я*                 | -               | -                    | xx/kropivnicky/kropv-105      |
| Чтобы̀ слуга̀ оста̀лся;                                         | Что̀бы слуга̀ оста̀лся;                                         | Чтобы̀ слуга̀ оста̀лся;                                         | Я             | Я*                 | -               | -                    | xviii/hemnitser/hemn-044      |
| Тѝшь... / Мо̀рок...                                           | Тишь... / Мо̀рок...                                           | Тишь... / Мо̀рок...                                           | Дк            | Аф                 | -               | -                    | xx/andreev/andrv-021          |
| Из дѐтства берѐт исто̀ки.                                     | Из дѐтства берѐт исто̀ки.                                     | Из дѐтства берѐт истокѝ.                                     | Дк            | Аф                 | -               | -                    | xx/china/china-261            |
| Ловко, ла̀дно, удо̀бно, здоро̀во:                               | Ло̀вко, ла̀дно, удо̀бно, здо̀рово:                               | Ловко, ла̀дно, удо̀бно, здо̀рово:                               | Ан            | Дк                 | -               | -                    | xx/slucky/sluc-0416           |
| «Не белы̀-то снежкѝ!..»                                       | «Не белы-то̀ снѐжки!..»                                       | «Нѐ белы-то̀ снежкѝ!..»                                       | Ан            | Дк                 | -               | -                    | xix/nikitin/nikit-102         |
| како̀го ро̀ста --                                              | како̀го ро̀ста --                                              | ка̀кого ро̀ста --                                              | Я             | Д                  | -               | -                    | xx/sapgir/sapgr-757           |
| сквозь Бо̀га Со̀сен                                            | сквозь Бо̀га Сосѐн                                            | скво̀зь Бога Со̀сен                                            | Я             | Д                  | -               | -                    | xx/aygi/aygi-242              |
| Ра̀стяжѐлым у̀тюго̀м                                            | Растя̀желым утюго̀м                                            | Ра̀стяжѐлым у̀тюго̀м                                            | Х             | Х*                 | -               | -                    | xx/bely/bely-222              |
| по̀эмѝма, по̀эмѝма.                                            | поэ̀мима, поэ̀мима.                                            | по̀эмѝма, по̀эмѝма.                                            | Х             | Х*                 | -               | -                    | xx/voznesensky/vozns-301      |
| -- Го̀род за двѐрью не тво̀й и не мо̀й!                         | -- Го̀род за двѐрью не твой и не мой!                         | -- Го̀род за двѐрью не тво̀й и нѐ мой!                         | Д             | Дк                 | -               | -                    | xx/tixonov/tixon-041          |
| Гла̀за протру̀ -- / я в своѐм ли умѐ:                          | Глаза̀ протру̀ -- / я в своем ли умѐ:                          | Глаза̀ протру̀ -- / я в своѐм ли умѐ:                          | Д             | Дк                 | -               | -                    | xx/evtushenko/evtus-707       |
| мне ка̀жется, я̀ ловлю̀                                         | мне ка̀жется, я ловлю̀                                         | мне ка̀жется̀, я ло̀влю                                         | Дк            | Я                  | -               | -                    | xx/sedakova/sedak-300         |
| О, жѝзнь ничего̀ не зна̀чит.                                   | О, жизнь ничего̀ не зна̀чит.                                   | О, жѝзнь ничѐго нѐ значѝт.                                   | Дк            | Я                  | -               | -                    | xx/sedakova/sedak-313         |
| Ду̀шу приучѝть не могу̀ --                                     | Ду̀шу приучѝть не могу̀ --                                     | Душу прѝучѝть не могу̀ --                                     | Тк            | Дк                 | -               | -                    | xx/tixonov/tixon-082          |
| Светлей ка̀мня самоцвѐтного                                   | Светлѐй ка̀мня самоцвѐтного                                   | Светлей ка̀мня самоцвѐтного                                   | Тк            | Дк                 | -               | -                    | xix/1790-1810_poets/poets-111 |
| Арѐй -- Дионѝ́с!                                              | Арѐй -- Диони́с!                                              | Арѐй -- Дио̀ни́с!                                              | Аф            | Я                  | -               | -                    | xx/vivanov/vivan-0168         |
| Усну̀л.                                                       | Усну̀л.                                                       | Усну̀л.                                                       | Аф            | Я                  | -               | -                    | xx/cerny/cern1-228            |
| времена̀ми прозрева̀ю что я̀ ино̀й                               | времена̀ми прозрева̀ю что я ино̀й                               | времена̀ми прозрева̀ю что я ино̀й                               | Тк            | Ак                 | -               | -                    | xx/cvetkov/cvetk-197          |
| жизнью пло̀ти, жа̀дно подгля̀дывающей за выкрута̀сами грѐшников, | жѝзнью плотѝ, жа̀дно подгля̀дывающей за выкрута̀сами грѐшников, | жѝзнью плотѝ, жа̀дно подгля̀дывающей за выкрута̀сами грѐшников, | Тк            | Ак                 | -               | -                    | xx/moritz/mrtz-0722           |
| Да̀льниѐ края̀.                                                | Да̀льние кра̀я.                                                | Да̀льние кра̀я.                                                | Х             | Д                  | -               | -                    | xx/pereval/perev-074          |
| С пѝкою на̀перевѐс.                                           | С пико̀ю наперевѐс.                                           | С пѝкою̀ напѐревѐс.                                           | Д             | Х                  | -               | -                    | xx/elagin/elag-019            |
| «Благо̀прия̀тна на̀м судьбѝна,\nПетр рѐк, к ним о̀склабля̀я взо̀р: | «Благоприя̀тна нам судьбѝна,\nПетр рек, к ним осклабля̀я взор: | «Благо̀прия̀тна на̀м судьбѝна,\nПетр рѐк, к ним о̀склабля̀я взор: | Я             | Я~Я                | -               | 1/2                  | xviii/derzhavin/derz2060      |
| Острова̀ эти на̀м пригрѐзились,                                | О̀строва э̀ти нам пригрезѝлись,                                | О̀строва̀ эти на̀м пригрѐзились,                                | Дк            | Х~Х                | -               | 1/2                  | xx/galich/galich-164          |
| Всю̀ду лишь бра̀нный клѝк,                                     | Всю̀ду лишь бра̀нный клик,                                     | Всю̀ду лишь бра̀нный клѝк,                                     | Л             | Дк                 | -               | -                    | xix/soloviev_v/vsolov-126     |

#+begin_src python
  conn.close()
#+end_src

#+RESULTS:
: None
